blog-posts/2004-02-29-action-groups-for-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Action groups for Emacs</title>
<!-- 2014-04-30 Wed 17:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Action groups for Emacs</h1>
<p>
February 29th, 2004 -
<a href="http://sachachua.com/blog/p/1800"><a href="http://sachachua.com/blog/p/1800">http://sachachua.com/blog/p/1800</a></a>
</p>

<blockquote>
<p>
Agroups (Action Groups) 2.3 for Emacs has been released and is
available
 for download at
</p>
</blockquote>

<p>
<a href="http://www.interhack.net/projects/agroups"><a href="http://www.interhack.net/projects/agroups">http://www.interhack.net/projects/agroups</a></a>
</p>

<blockquote>
<p>
If you like to automate your day to day work-flow you might like
Agroups.
</p>
</blockquote>

<p>
Short Overview
</p>

<blockquote>
<p>
Action Groups are groups of action entries that an Emacs user can
 create, save, name and access quickly. In a general sense these
actions
 are any automation that a user can imagine to help with his
activities.
 The user instantiates these automations as action entries which are a
 specific instances of some action from the current collection of
 actions. Actions can be as simple as finding a commonly used file in
a
 buffer, to more complex like executing a previously defined keyboard
 macro, to very complex like an unimaginable whopper defined by a user
 created Action Template. Action Templates are an extensibility
feature
 of Action Groups and allows the user to easily create new actions,
 Agroups supplies a useful predefined collection of actions created
with
 Action Templates.
</p>
</blockquote>

<blockquote>
<p>
A collection of action entries is called an action group. Typically
 the user associates each action group with a concentrated activity
such
 as a project. Each entry of an action group is associated with a
 specific instance of an action. A group itself is actually an entry
 associated with a special action called `group' so that a group entry
 can be yet another group itself. This implies that groups can have
 subgroups and subgroups can have subgroups and so on. This gives the
 user structured organizational capabilities.
</p>
</blockquote>

<blockquote>
<p>
The Action Groups facility was designed to allow easy and fast
 creation of groups and entries to help automate an Emacs user's work.
 At the same time it was designed to allow fast execution of the
 entries. To this end a user can use the Emacs completion facility to
 execute entries or key bindings or a combination of both.
</p>
</blockquote>

<p>
E-Mail from William Paul Vrotney
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
